Repository: qsniyg/maxurl
Catalog: po/*.po
Languages: ru

source: $language_native$
ru: Русский

source: $description$
ru: Находит увеличенные или оригинальные версии изображений для более чем 8000 веб-сайтов

source: options_header
ru: Параметры

source: yes
ru: Да

source: no
ru: Нет

source: Import
ru: Импорт

source: Export
ru: Экспорт

source: Requires:
ru: Требуется:

source: category_redirection
ru: Перенаправление

source: category_popup
ru: Всплывающее окно

source: subcategory_update
ru: Обновление

source: subcategory_settings
ru: Настройки

source: subcategory_ui
ru: Интерфейс

source: subcategory_trigger
ru: Действия всплывающего окна

source: subcategory_popup_source
ru: Источник

source: subcategory_open_behavior
ru: Поведение при открытии

source: subcategory_close_behavior
ru: Поведение при закрытии

source: subcategory_behavior
ru: Поведение всплывающего окна

source: subcategory_video
ru: Видео/Аудио

source: subcategory_gallery
ru: Галерея

source: subcategory_popup_other
ru: Прочее

source: subcategory_cache
ru: Кэш

source: category_keybinds
ru: Горячие клавиши

source: subcategory_keybinds_popup_actions
ru: Действия всплывающего окна

source: Mouse cursor
ru: Курсор мыши

source: category_rules
ru: Правила

source: subcategory_rule_specific
ru: Специфика правил

source: category_website
ru: Сайты

source: saved_refresh_target
ru: Сохранено с обновлением цели

source: saved_no_refresh
ru: Сохранено без обновления

source: save
ru: Сохранить

source: record
ru: Запись

source: cancel
ru: Отмена

source: Mouseover popup (%%1) is needed to display the original version
ru: Всплывающее окно наведения курсора мыши (%%1) необходимо для отображения исходной версии

source: custom headers
ru: Пользовательские заголовки

source: forces download
ru: Скачать принудительно

source: Close
ru: Закрыть

source: Previous
ru: Предыдущее

source: Next
ru: Следуещее

source: Left Arrow
ru: Стрелка влево

source: Right Arrow
ru: Стрелка вправо

source: subcategory_extension
ru: Расширения

source: rotate_left_btn
ru: Кнопка поворота влево

source: rotate_right_btn
ru: Кнопка поворота вправо

source: category_extra
ru: Дополнительно

source: subcategory_replaceimages
ru: Замена изображений

source: subcategory_highlightimages
ru: Выделение изображений

source: category_general
ru: Основное

source: Enable extension
ru: Включить расширение

source: Globally enables or disables the extension
ru: Включает или отключает расширение глобально

source: Language
ru: Язык

source: Language for this extension
ru: Язык для этого расширения

source: English
ru: Английский

source: Español
ru: Испанский

source: Français
ru: Французкий

source: Italiano
ru: Итальянский

source: 한국어
ru: Корейский

source: Dark mode
ru: Тёмная тема

source: Changes the colors to have light text on a dark background
ru: Изменяет цвета, делая текст на тёмном фоне, светлым.

source: Description below options
ru: Описание под параметрами

source: Shows the description below the options (otherwise the description is only shown when you hover over the option's name)
ru: Показывает описание под параметрами (в противном случае описание отображается только при наведении курсора мыши на имя параметра)

source: Show disabled options
ru: Показывать отключенные параметры

source: If disabled, options that are disabled due to their requirements being unmet will not be displayed
ru: Если этот параметр отключен, то параметры, которые отключены из-за невыполнения их требований, не будут отображаться

source: Show disabled trigger profiles
ru: Показывать отключенные целевые профили

source: If disabled, options for alternate trigger profiles (options with `(#2)` after them) will not be shown if the relevant trigger isn't active
ru: Если этот параметр отключен, параметры альтернативных целевых профилей (параметры с `(#2)` после них) не будут отображаться, если соответствующий триггер не активен

source: Requirements below disabled options
ru: Требования под отключенными параметрами

source: If an option is disabled, the requirements to enable the option will be displayed below it
ru: Если параметр отключен, то под ним будут отображаться требования для его включения

source: Check for updates
ru: Проверять наличие обновлений

source: Periodically checks for updates. If a new update is available, it will be shown at the top of the options page
ru: Периодически проверяет наличие обновлений. Новое обновление будет показано в верхней части страницы параметров.

source: Update check interval
ru: Интервал проверки обновления

source: How often to check for updates
ru: Как часто будет происходить проверка наличия обновлений

source: hours
ru: ч.

source: Notify when update is available
ru: Уведомлять о наличии обновления

source: Creates a browser notification when an update is available
ru: Создаёт уведомление в браузере, когда обновление доступно.

source: Show advanced settings
ru: Показывать дополнительные настройки

source: If disabled, settings that might be harder to understand will be hidden
ru: Если отключено, то более сложные настройки, будут скрыты

source: Use tabs
ru: Использовать вкладки

source: If disabled, all settings will be shown on a single page
ru: Если отключено, все настройки будут отображаться на одной странице

source: Alphabetical order
ru: В алфавитном порядке

source: Lists options in alphabetical order
ru: Список параметров будет отсортирован в алфавитном порядке

source: Allow using browser XHR
ru: Разрешить браузеру использовать XHR

source: This allows XHR requests to be run in the browser's context if they fail in the extension (e.g. when Tracking Protection is set to High)
ru: Это позволяет запускать запросы XHR в контексте браузера, если они не работают в расширении (например, когда защита отслеживания установлена на Высокий уровень)

source: Retry requests with 503 errors
ru: Повторять запрос с ошибкой 503

source: Amount of times to retry a request when 503 (service unavailable) is returned by the server
ru: Количество повторных попыток запроса, когда сервер возвращает 503 (служба недоступна)

source: times
ru: раз(а)

source: Delay between 503 retries
ru: Задержка между повторами 503

source: Time (in milliseconds) to delay between retrying requests that received 503
ru: Время (в миллисекундах) для задержки между повторной попыткой запросов при получении 503

source: Use `Blob` over `ArrayBuffer`
ru: Использовать `Blob` поверх `ArrayBuffer`

source: Uses `Blob`s for XHRs instead of `ArrayBuffer`s. Keep this enabled unless your userscript manager doesn't support blob requests
ru: Использует `Blob`ы для XHR, вместо `ArrayBuffer`ов. Оставьте это включенным, если ваш менеджер пользовательских скриптов не поддерживает запросы blob.

source: Live settings reloading
ru: Перезагрузка настроек в реальном времени

source: Enables/disables live settings reloading. There shouldn't be a reason to disable this unless you're experiencing issues with this feature
ru: Включает/выключает перезагрузку параметров в реальном времени. Не должно быть причин для отключения этой функции. Отключить только если у вас есть с ней проблемы.

source: Disable keybindings when editing text
ru: Отключить горячие клавиши при редактировании текста

source: Disables shortcuts when key events are sent to an input area on the page
ru: Отключает горячие клавиши при отправке событий клавиш в область ввода на странице

source: Use `GM_download` if available
ru: Использовать `GM_download`, если доступно

source: Prefers using `GM_download` over simple browser-based downloads, if the function is available. Some userscript managers download the entire file before displaying a save dialog, which can be undesirable for large video files
ru: Предпочтительно использует `GM_download` вместо простых скачиваний в браузере, если эта функция доступна. Некоторые менеджеры пользовательских скриптов скачивает весь файл перед отображением диалога сохранения, что может быть нежелательно для больших видеофайлов.

source: Maximum size to `GM_download`
ru: Максимальный размер для `GM_download`

source: If a file is larger than this size, use a simple browser-based download instead. Set to `0` for unlimited.
ru: Если файл больше этого размера, используется простое скачивание через браузер. `0` - неограниченно.

source: MB
ru: МБ

source: Force save dialog when downloading
ru: Принудительное диалоговое окно сохранения при скачивании

source: Tries to ensure the 'save as' dialog displays when downloading. This requires the 'downloads' permission to work, and will sometimes not work when custom headers are required.
ru: Посторается обеспечить отображение диалогового окна 'Сохранить как' при скачивании. Для этого требуется разрешение на 'скачивание', и иногда не будет работать, когда требуются пользовательские заголовки.

source: Enable writing to clipboard
ru: Включить запись в буфер обмена

source: This option does nothing on its own, but enabling it allows other functionality that require writing to the clipboard to work
ru: Эта опция сама по себе ничего не делает, но её включение позволяет работать другим функциям, требующим записи в буфер обмена.

source: Enable redirection
ru: Включить перенаправление

source: Automatically redirect media opened in their own tab to their larger/original versions
ru: Автоматически перенаправляет открытое медиа на новую вкладку к их более крупныой/оригинальной версии

source: Allow video
ru: Разрешить видео

source: Allows redirecting from/to video
ru: Позволяет перенаправлять с/на видео

source: Allow audio
ru: Разрешить аудио

source: Allows redirecting from/to audio
ru: Позволяет перенаправлять с/на аудио

source: Add to history
ru: Добавлять в историю

source: Redirection will add a new entry to the browser's history
ru: Перенаправление будет добавлять новую запись в историю браузера

source: Do redirection in extension
ru: Делать перенаправление в расширении

source: Performs the redirection in the extension instead of the content script. This is significantly faster and shouldn't cause issues in theory, but this option is kept in case of regressions
ru: Выполняет перенаправление в расширении вместо скрипта содержимого. Теоритически это значительно быстрее и не должно вызывать проблем, но этот параметр сохраняется в случае регрессий.

source: Use GET if HEAD is unsupported
ru: Использовать GET, если HEAD не поддерживается

source: Use a GET request to check an image's availability, if the server does not support HEAD requests
ru: Будет использоваться GET-запрос для проверки доступности изображения, если сервер не поддерживает запросы HEAD.

source: Show image URL in tooltip
ru: Показывать ссылку изображения во всплывающей подсказке

source: If the popup is needed to display the larger version of an image, display the image link in the tooltip
ru: Если всплывающее окно необходимо для отображения увеличенной версии изображения, отобразите ссылку на изображение во всплывающей подсказке.

source: Hide tooltip after
ru: Скрыть всплывающую подсказку после

source: Hides the tooltip after the specified number of seconds (or when the mouse clicks on it). Set to 0 to never hide automatically
ru: Скрывает всплывающую подсказку после указанного количества секунд (или когда мышь щёлкает по ней). 0 - автоматически никогда не скрывать.

source: Log info object to console
ru: Журнал информации объекта в консоли

source: Prints the full info object to the console whenever a popup/redirect is found
ru: Выводит полную информацию объекта в консоль всякий раз, когда обнаруживается всплывающее окно/перенаправление

source: Disable when response headers need modifying
ru: Отключать, когда заголовки ответов нуждаются в изменении

source: This option works around Chrome's migration to manifest v3, redirecting some images to being force-downloaded
ru: Этот параметр работает вокруг миграции Chrome в manifest v3, перенаправляя некоторые изображения к принудительному скачиванию

source: Redirect to largest without issues
ru: Перенаправлять на самое большое без проблем

source: Redirects to the largest image found that doesn't require custom headers or forces download
ru: Перенаправляет на самое большое найденное изображение, которое не требует пользовательских заголовков или принудительного скачивания.

source: Redirect for HTML pages too
ru: Перенаправлять для HTML-страниц тоже

source: Tries redirection even if the host page is HTML. This option might be useful for dead links. However, this will also result in many normal pages being redirected to images/video, so please avoid enabling this by default!
ru: Пытается перенаправить, даже если хост является страницой HTML. Этот параметр может быть полезен для мёртвых ссылок. Однако, это также приведёт к тому, что многие обычные страницы будут перенаправлены на изображения/видео, поэтому, не включайте это по умолчанию!

source: This will result in many pages being redirected to images/videos. I'd recommend only enabling this for the media you need it for, then disabling it after.
ru: В результате многие страницы будут перенаправлены на изображения/видео. Я бы порекомендовал включать это только для тех медиа, для которых это нужно, а после затем отключить.

source: Enable mouseover popup
ru: Включить всплывающее окно при наведении мыши

source: Show a popup with the larger image when you mouseover an image with the trigger key held (if applicable)
ru: Показывать всплывающее окно с увеличенным изображением при наведении курсора мыши на изображение с удерживаемой целевой клавишей (если применимо).

source: Mouseover popup trigger
ru: Действие всплывающего окна при наведении на него мыши

source: How the popup will get triggered
ru: Как будет срабатывать всплывающее окно

source: Mouseover
ru: При наведение курсора мыши

source: Triggers when your mouse is over the image
ru: Срабатывает при наведении курсора на изображении

source: Key trigger
ru: При нажатии клавиши

source: Triggers when you press a key sequence when your mouse is over an image
ru: Срабатывает при нажатии комбинации клавиш, когда курсор находится на изображении.

source: Disables the popup from being triggered (useful if you only want to use the context menu item)
ru: Отключает срабатывание всплывающего окна (полезно, если вы хотите использовать только пункт контекстного меню)

source: Popup trigger key
ru: Комбинация клавиш запуска всплывающего окна

source: Key sequence to trigger the popup
ru: Комбинация клавиш при которой запускается всплывающее окно

source: Popup trigger key (#2)
ru: Комбинация клавиш запуска всплывающего окна (#2)

source: Key sequence to trigger the popup with alternate options. Search for `(#2)` to find the relevant options
ru: Комбинация клавиш при которой запускается всплывающее окно с альтернативными параметрами. Ищите `(#2)`, чтобы найти соответствующие параметры.

source: Popup trigger key (#3)
ru: Комбинация клавиш запуска всплывающего окна (#3)

source: Key sequence to trigger the popup with alternate options. Search for `(#3)` to find the relevant options
ru: Комбинация клавиш при которой запускается всплывающее окно с альтернативными параметрами. Ищите `(#3)`, чтобы найти соответствующие параметры.

source: Popup trigger delay
ru: Задержка срабатывания всплывающего окна

source: Delay (in seconds) before the popup shows
ru: Задержка (в секундах) до появления всплывающего окна

source: Use mouseover event
ru: Использовать событие наведения курсора мыши

source: Uses the mouseover event instead of mousemove to figure out where to trigger the popup. This more closely matches the way other image popup addons work, at the cost of configurability
ru: Использует событие 'наведения курсора мыши' вместо 'движения курсора мыши', чтобы выяснить, где вызвать всплывающее окно. Это более точно соответствует тому, как работают другие дополнения к всплывающим изображениям, за счёт конфигурируемости/

source: Enable/disable toggle
ru: Включить/Выключить

source: Controls whether the 'Popup enable/disable key' will enable or disable the popup from opening
ru: Управляет тем, будет ли 'Клавиша включения/отключения всплывающего окна' включать или отключать открытие всплывающего окна.

source: Enable
ru: Включить

source: Disable
ru: Отключить

source: Popup enable/disable key
ru: Клавиша включения/отключения всплывающего окна

source: Holding down this key will enable or disable the popup from being opened, depending on the 'Enable/disable toggle' setting
ru: Удерживание этой клавиши включит или отключит всплывающее окно, в зависимости от настройки 'Включить/Выключить'.

source: Allow showing partially loaded
ru: Разрешить показывать частично загруженные

source: This will allow the popup to open for partially loaded media. Partially loaded media will contain the source URL directly (where possible), whereas fully loaded media will use a blob or data URL.
ru: Это позволит открыть всплывающее окно для частично загруженных медиа. Частично загруженные медиа будут содержать исходный URL напрямую (где это возможно), тогда как полностью загруженные медиа будут использовать BLOB или URL-адрес данных.

source: This will allow the popup to open for partially loaded media, but this might break images that require custom headers to display properly. Partially loaded media will contain the source URL directly (where possible), whereas fully loaded media will use a blob or data URL.
ru: Это позволит открыть всплывающее окно для частично загруженных медиа, но это может поломать изображения, для правильного отображения которых требуются пользовательские заголовки. Частично загруженные медиа будут содержать исходный URL-адрес напрямую (где это возможно), тогда как полностью загруженные медиа будут использовать BLOB или URL-адрес данных.

source: Streams
ru: Потоки

source: Audio and video
ru: Аудио и видео

source: Media
ru: Медиа

source: Images, audio, and video
ru: Изображения, аудио и видео

source: Avoid HEAD request for partially loaded media
ru: Избегать запросы HEAD для частично загруженных медиа

source: Avoids a possibly unnecessary HEAD request before displaying partially loaded images, which further decreases the delay before opening the popup. This can cause issues if the server returns an error, but still returns an image
ru: Избегает ненужного запроса HEAD перед отображением частично загруженных изображений, что еще больше уменьшает задержку перед открытием всплывающего окна. Это может вызвать проблемы, если сервер вернёт ошибку, но все равно вернет изображение.

source: Use `blob:` over `data:` URLs
ru: Использовать `blob:` поверх `data:` URL

source: Blob URLs are more efficient, but aren't supported by earlier browsers. Some websites also block `blob:` URLs
ru: Blob URL более эффективны, но не поддерживаются старыми браузерами. Некоторые сайты также блокируют `blob:` URL.

source: Load media anonymously
ru: Загружать медиа анонимно

source: Loads the media without sending any cookies or other forms of credentials. This is required to screenshot videos from other sources
ru: Загружает медиа без отправки куки-файлов или других форм учётных данных. Это необходимо для скриншотов видео из других источников.

source: Use `not-allowed` cursor when unsupported
ru: Использовать курсор `запрещено`, если не поддерживается

source: If the image isn't supported, the mouse cursor will change to a `not-allowed` cursor for a brief duration
ru: Если изображение не поддерживается, курсор мыши на короткое время изменится на `запрещено`.

source: Use `not-allowed` cursor when unable to load
ru: Использовать курсор `запрещено`, если невозможно загрузить

source: If the image fails to load, the mouse cursor will change to a `not-allowed` cursor for a brief duration
ru: Если изображение не загружается, курсор мыши на короткое время изменится на `запрещено`.

source: `not-allowed` cursor duration
ru: Длительность курсора `запрещено`

source: How long the `not-allowed` cursor should last
ru: Как долго отображается курсор `запрещено`

source: Exclude page background
ru: Исключать фон страницы

source: Excludes the page background for the popup
ru: Исключает фон страницы для всплывающего окна.

source: Exclude `background-image`s
ru: Исключать `background-image`

source: Excludes `background-image`s for the popup. Might prevent the popup from working on many images
ru: Исключает `background-image` для всплывающего окна. Это может помешать всплывающему окну работать со многими изображениями.

source: Exclude image tabs
ru: Исключать вкладки с изображениями

source: Excludes images that are opened in their own tabs
ru: Исключает изображения, открытые в собственных вкладках.

source: Exclude if media URL is unchanged
ru: Исключать, если ссылка медиа не изменилась

source: Don't pop up if the new URL is the same as the source
ru: Всплывающее окно не появляется, если ссылка как у источника.

source: Only popup for linked media
ru: Всплывающее окно только для медиа с ссылкой

source: Don't pop up if the media isn't hyperlinked
ru: Всплывающее окно не появляется, если медиа не имеет гиперссылки

source: Popup link for linked media
ru: Всплывающее окно ссылки для медиа с ссылками

source: If the linked media cannot be made larger, pop up for the link instead of the media
ru: Если медиа с ссылкой не может быть увеличено, всплывает ссылка вместо медиа.

source: Exclude image maps
ru: Исключать карты изображений

source: Don't pop up if the image is an image map (image with multiple clickable areas)
ru: Всплывающее окно не появится, если изображение представляет собой карту изображения (изображение с несколькими кликальными областями).

source: Autoplay
ru: Автовоспроизведение

source: Play automatically once the popup is opened
ru: Автоматически воспроизводится после открытия всплывающего окна.

source: Show video controls
ru: Показывать элементы управления видео

source: Shows native video controls. Note that this prevents dragging under Firefox
ru: Показывает встроенные средства управления видео. Обратите внимание, что это предотвращает перетаскивание под Firefox.

source: Toggle video controls
ru: Переключатель элементов управления видео

source: Key to toggle whether the video controls are shown
ru: Клавиша для переключения отображения элементов управления видео

source: Loop
ru: Зациклить

source: Allows the media to automatically restart to the beginning after finishing playing
ru: Позволяет медиа автоматически перезапускаться в начало после завершения воспроизведения.

source: Max duration for looping
ru: Максимальная длительность зацикливания

source: Media longer than the specified duration will not be automatically looped. Setting this to `0` will always enable looping, regardless of duration.
ru: Медиа с дольшей указанной длительностью не будет автоматически зациклены. Установка этого значения на `0` всегда будет включать зацикливание, независимо от длительности.

source: Play/pause key
ru: Кнопка воспроизведения/приостановки

source: Key to toggle whether the media is playing or paused
ru: С помощью этой кнопки, вы сможете воспроизводить или приостанавливать медиа.

source: Mute
ru: Отключать звук

source: Mutes the media by default
ru: Отключает звук медиа по умолчанию.

source: Toggle mute key
ru: Кнопка отключения звука

source: Key to toggle mute
ru: С помощью этой кнопки, вы сможете переключать звук.

source: Default volume
ru: Громкость по умолчанию

source: Default volume for the media
ru: Громкость звука для медиа по умолчанию.

source: Volume up key
ru: Кнопка увеличения громкости

source: Key to increase the volume
ru: С помощью этой кнопки, вы сможете увеличить громкость звука.

source: Volume down key
ru: Кнопка уменьшения громкости

source: Key to decrease the volume
ru: С помощью этой кнопки, вы сможете уменьшать громкость звука.

source: Volume change amount
ru: Величина изменения громкости

source: Percent for volume to increase/decrease when using the volume up/down keys
ru: Процент для увеличения/уменьшения громкости при использовании кнопок увеличения/уменьшения громкости.
