Repository: qsniyg/maxurl
Catalog: po/*.po
Languages: ru

source: Queries Instagram for albums when using the popup on a post thumbnail
ru: Запросы к Instagram для альбомов при использовании всплывающего окна на миниатюре поста.

source: Snapchat: Use original media without captions
ru: Snapchat: Использовать оригинальные медиа без подписей

source: Prefers using original media instead of media with captions and tags overlayed
ru: Предпочитает использовать оригинальные медиа вместо медиа с наложенными подписями и тегами.

source: TikTok: Don't use watermarked videos
ru: TikTok: Не использовать видео с водяными знаками

source: Uses non-watermarked videos for TikTok if possible. This will introduce an extra delay when loading the video as two extra requests need to be performed. It will also fail for any videos uploaded after ~late July 2020
ru: По возможности использует видео без водяных знаков для TikTok. Это приведёт к дополнительной задержке при загрузке видео, так как необходимо выполнить два дополнительных запроса. Это не будет работать для любых видео, загруженных после ~конца июля 2020 года.

source: TikTok: 3rd-party watermark removal
ru: TikTok: Удаление водяных знаков третьей стороной

source: Uses a 3rd-party watermark removal site for TikTok. I do not endorse any of the sites supported. They may log your IP address and videos you submit. Use this option with caution. `LQ` = Low quality, `PL` = Public log
ru: Использует сторонний сайт удаления водяных знаков для TikTok. Я не одобряю ни один из поддерживаемых сайтов. Они могут регистрировать ваш IP-адрес и видео, которые вы отправляете. Используйте этот параметр с осторожностью. `НК` = Низкое качество, `ПЖ` = Публичный журнал

source: (none)
ru: (ничего)

source: keeptiktok.com (LQ)
ru: keeptiktok.com (НК)

source: ssstiktok.io (LQ)
ru: ssstiktok.io (НК)

source: musicallydown.com (LQ/PL)
ru: musicallydown.com (НК/ПЖ)

source: snaptik.app (LQ)
ru: snaptik.app (НК)

source: Tumblr: API key
ru: Tumblr: ключ API

source: API key for finding larger images on Tumblr
ru: Ключ API для поиска больших изображений на Tumblr

source: Twitter: Use extension
ru: Twitter: Использовать расширение

source: Prefers `.jpg?name=orig` over `?format=jpg&name=orig`. This will possibly incur extra requests before succeeding
ru: Предпочитает `.jpg?name=orig` поверх `?format=jpg&name=orig`. Это, возможно, принесёт дополнительные запросы, прежде чем завершиться.

source: Blacklist
ru: Чёрный список

source: A list of URLs (one per line) that are blacklisted from being processed
ru: Список URL-адресов (по одному на строку), которые занесены в чёрный список для обработки.

source: The examples below are written for the simple (glob) engine, not the regex engine. The glob engine is generally based on the UNIX glob syntax.<br /> <ul><br /> <li><code>google.com</code> will block https://google.com/, https://www.google.com/, https://abcdef.google.com/, https://def.abc.google.com/, etc.</li> <li><code>abc.google.com</code> will block https://abc.google.com/, https://def.abc.google.com/, etc.</li> <li><code>*.google.com</code> will block https://www.google.com/, https://def.abc.google.com/, etc. but not https://google.com/</li> <li><code>google.*/</code> will block https://google.com/, https://www.google.co.uk, etc.</li> <li><code>http://google.com</code> will block http://google.com/, but not https://google.com/, http://www.google.com/, etc.</li> <li><code>google.com/test</code> will block https://google.com/test, https://www.google.com/test/abcdef, but not https://google.com/, etc.</li> <li><code>google.com/*/test</code> will block https://google.com/abc/test, but not https://google.com/test or https://google.com/abc/def/test</li> <li><code>google.com/**/test</code> will block https://google.com/abc/test, https://google.com/abc/def/test, https://google.com/abc/def/ghi/test, etc. but not https://google.com/test</li> <li><code>g??gle.com</code> will block https://google.com/, https://gaagle.com/, https://goagle.com/, etc.</li> <li><code>google.{com,co.uk}</code> will block https://google.com/ and https://google.co.uk/</li> <li><code>g[oau]ogle.com</code> will block https://google.com/, https://gaogle.com/, and http://www.guogle.com/</li> <li><code>g[0-9]ogle.com</code> will block https://g0ogle.com/, https://g1ogle.com/, etc. (up to https://g9ogle.com/)</li> </ul>
ru: Приведенные ниже примеры написаны для простого (glob) движка, а не для движка регулярных выражений. Механизм glob обычно основан на синтаксисе UNIX glob.<br /> <ul><br /> <li><code>google.com</code> будет блокировать https://google.com/, https://www.google.com/, https://abcdef.google.com/, https://def.abc.google.com/, и т.д.</li> <li><code>abc.google.com</code> будет блокировать https://abc.google.com/, https://def.abc.google.com/, и т.д.</li> <li><code>*.google.com</code> будет блокировать https://www.google.com/, https://def.abc.google.com/, и т.д., но не https://google.com/</li> <li><code>google.*/</code> будет блокировать https://google.com/, https://www.google.co.uk, и т.д.</li> <li><code>http://google.com</code> будет блокировать http://google.com/, но не https://google.com/, http://www.google.com/, и т.д.</li> <li><code>google.com/test</code> будет блокировать https://google.com/test, https://www.google.com/test/abcdef, но не https://google.com/, и т.д.</li> <li><code>google.com/*/test</code> будет блокировать https://google.com/abc/test, но не https://google.com/test или https://google.com/abc/def/test</li> <li><code>google.com/**/test</code> будет блокировать https://google.com/abc/test, https://google.com/abc/def/test, https://google.com/abc/def/ghi/test, и т.д., но не https://google.com/test</li> <li><code>g??gle.com</code> будет блокировать https://google.com/, https://gaagle.com/, https://goagle.com/, и т.д.</li> <li><code>google.{com,co.uk}</code> будет блокировать https://google.com/ и https://google.co.uk/</li> <li><code>g[oau]ogle.com</code> будет блокировать https://google.com/, https://gaogle.com/, и http://www.guogle.com/</li> <li><code>g[0-9]ogle.com</code> будет блокировать https://g0ogle.com/, https://g1ogle.com/, и т.д. (вплоть до https://g9ogle.com/)</li> </ul>

source: Blacklist engine
ru: Движок чёрного списка

source: How the blacklist should be processed
ru: Как следует обрабатывать чёрный список.

source: Simple (glob)
ru: Простой (glob)

source: Regex
ru: Регулярное выражение

source: Filename format
ru: Формат имени файла

source: Format string(s) for the filename
ru: Формат строк(и) для имени файла.

source: Documentation
ru: Документация

source: Trigger keybinding that will run the Replace Images function
ru: Вызывает привязку клавиш, которая запустит функцию замены изображений.

source: Automatically replace images
ru: Автозамена изображений

source: Automatically replace images to larger versions on pages you view
ru: Автозамена изображений на более крупные версии на просматриваемых страницах.

source: This could lead to rate limiting or IP bans
ru: Это может привести к ограничению скорости или блокировке IP-адреса.

source: Use data URLs
ru: Использовать data URL

source: Uses data:// URLs instead of image links. Disabling this may improve compatibility with some bulk image downloader extensions
ru: Использует data:// URL вместо ссылок на изображения. Отключение этого параметра может улучшить совместимость с некоторыми расширениями массового скачивания изображений.

source: Wait until image is fully loaded
ru: Ждать полную загрузку изображения

source: Waits until the image being replaced is fully loaded before moving on to the next image
ru: Ждёт пока заменяемое изображение не будет полностью загружено прежде чем перейти к следующему изображению.

source: Max images to process at once
ru: Максимально изображений для одновременной обработки

source: The maximum amount of images to process at once
ru: Максимальное количество изображений для обработки одновременно.

source: Max images per domain at once
ru: Максимально изображений на домен одновременно

source: The maximum amount of images per domain to process at once
ru: Максимальное количество изображений на домен для одновременной обработки.

source: images
ru: Изображения

source: Delay between same-domain images
ru: Задержка между однодоменными изображениями.

source: New requests for images in the same domain will be delayed by this amount of seconds. Useful for avoiding rate limits.
ru: Новые запросы на изображения в том же домене будут задерживаться на это количество секунд. Полезно для избежания ограничений скорости.

source: seconds
ru: сек.

source: Replace images
ru: Заменять изображения

source: Replaces images to their larger versions when the button is pressed
ru: Заменяет изображения на их более крупные версии при нажатии кнопки.

source: Add links
ru: Добавлять ссылки

source: Adds links around replaced media if a link doesn't already exist
ru: Добавляет ссылки вокруг заменённых медиа, если ссылки ещё не существует.

source: Replace links
ru: Заменять ссылки

source: Replaces links if they already exist
ru: Заменяет ссылки, если они уже существуют.

source: Plain hyperlinks
ru: Простые гиперссылки

source: How to treat plain (non-media) hyperlinks that link to potential media
ru: Как обращаться с простыми (немедийными) гиперссылками, которые ссылаются на потенциальные медиа.

source: Replace link+text
ru: Заменять ссылку+текст

source: Replace media
ru: Заменять медиа

source: Links open in new tab
ru: Открывать ссылки в новой вкладке

source: Clicking on a replaced link will open the media in a new tab
ru: Нажатие на заменённую ссылку откроет медиа в новой вкладке.

source: Ignore
ru: Игнорировать

source: Replacement CSS
ru: Замена CSS

source: CSS styles to apply to replaced media. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't yet supported here)
ru: Стили CSS для применения к заменяемым медиа. Дополнительные сведения смотрите в документации 'Стилизация CSS всплывающего окна' (здесь не поддерживаются переменные URL thumb/full).

source: Simple progress
ru: Простой прогресс

source: Uses a simpler progress bar that has a fixed size for all media. This is useful to see how many images are replaced, rather than the ETA
ru: Использует более простую шкалу прогресса, которая имеет фиксированный размер для всех медиа. Это полезно для того, чтобы увидеть, сколько изображений заменено, а не ждать.

source: Enable trigger key
ru: Включить клавишу действия

source: Enables the use of the trigger key to run it without needing to use the menu
ru: Позволяет использовать клавишу действия для запуска без необходимости использования меню.

source: Trigger key
ru: Клавиша действия

source: Trigger keybinding that will run the Highlight Images function
ru: Привязка клавиши действия, которое будет запускать функцию подсветки изображений.

source: Enable button
ru: Включить кнопку

source: Enables the 'Highlight Images' button
ru: Включает кнопку 'Подсветить изображения'.

source: Automatically highlight images
ru: Автоподсвечивать изображения

source: Automatically highlights images as you view pages
ru: Автоматически подсвечивает изображения при просмотре страниц.

source: Always
ru: Постоянно

source: Hover
ru: Наведение

source: When hovering over an image
ru: При наведении курсора на изображение.

source: Never
ru: Никогда

source: Only explicitly supported images
ru: Только явно поддерживаемые изображения

source: Only highlights images that can be made larger or the original version can be found
ru: Подсвечивает только изображения, которые могут быть увеличены или можно найти их оригинальную версию.

source: Highlight CSS
ru: CSS подсветка

source: CSS style to apply for highlight. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't supported here)
ru: Стилизация CSS, для применения к подсветке. Дополнительные сведения смотрите в документации 'Стилизация CSS всплывающего окна' (здесь не поддерживаются переменные URL thumb/full).

source: Mouseover popup action
ru: Действие всплывающего окна при наведение курсора

source: Determines how the mouseover popup will open
ru: Определяет, как откроётся всплывающее окно при наведении курсора мыши.

source: Popup
ru: Всплывающее окно

source: New tab
ru: Новая вкладка

source: New background tab
ru: Новая фоновая вкладка

source: Download
ru: Скачать

source: Copy link
ru: Копировать ссылку

source: Replace
ru: Заменить

source: Enable videos
ru: Включить видео

source: Allows videos to be popped up
ru: Позволяет открывать всплывающеее окно для видео

source: Enable audio
ru: Включить аудио

source: Allows audio to be popped up. Currently experimental. This only applies to audio files. Videos that contains audio are supported regardless of this setting.
ru: Позволяет открывать всплывающее окно для аудио. В настоящее время экспериментальный. Это относится только к аудиофайлам. Видео, содержащие аудио, поддерживаются независимо от этой настройки.

source: Allow HLS/DASH streams
ru: Разрешить потоки HLS/DASH

source: Allows playback of HLS/DASH streams
ru: Позволяет воспроизводить потоки HLS/DASH.

source: Instagram (higher quality)
ru: Instagram (более высокое качество)

source: YouTube (higher quality)
ru: YouTube (более высокое качество)
