Repository: qsniyg/maxurl
Catalog: po/*.po
Languages: ru

source: Resume playback from source
ru: Продолжать воспроизведение из источника

source: If enabled, playback will resume from where the source left off
ru: Если включено, воспроизведение будет возобновлено с того места, на котором остановился источник.

source: Resume if different length
ru: Возобновлять, если разная длина

source: If disabled, it will not resume if the source has a different length from the media in the popup (e.g. from a preview video to a full one)
ru: Если отключено, то не возобновляет, если длина из источника отличается от длины медиа во всплывающем окне (например, с предпросмотра видео до полного)

source: Pause source
ru: Приостанавливать из источника

source: Pauses the source once the popup has opened
ru: Приостанавливает источник после открытия всплывающего окна

source: Seek amount
ru: Количество запросов

source: Amount of time to seek forward/back when using the seek keys
ru: Количество времени для запроса вперед/назад при использовании кнопок запроса.

source: Seek left key
ru: Кнопка запроса влево

source: Key to seek backwards by the specified amount
ru: С помощью этой кнопки, вы сможете сделать запрос назад от заданого количества.

source: Seek right key
ru: Кнопка запроса вправо

source: Key to seek forwards by the specified amount
ru: С помощью этой кнопки, вы сможете сделать запрос вперёд от заданого количества.

source: Previous frame key
ru: Кнопка предыдущего кадра

source: Rewinds the video one "frame" backward. Due to current limitations, the frame size is static (but configurable), and might not match the video's framerate
ru: С помощью этой кнопки, вы сможете перематывать видео на один "кадр" назад. В связи с текущими ограничениями, размер кадра является статичным (но настраиваемым), и может не совпадать с частотой кадров видео.

source: Next frame key
ru: Кнопка следующего кадра

source: Advances the video one "frame" forward. Due to current limitations, the frame size is static (but configurable), and might not match the video's framerate
ru: С помощью этой кнопки, вы сможете перематывать видео на один "кадр" вперёд. В связи с текущими ограничениями, размер кадра является статичным (но настраиваемым), и может не совпадать с частотой кадров видео.

source: Frame rate
ru: Частота кадров

source: Frame rate for videos to seek forward/back with the next/previous frame keys
ru: Частота кадров видео для запроса вперёд/назад с помощью кнопок следующий/предыдущий кадр

source: FPS
ru: Кадров в секунду

source: Speed down key
ru: Кнопка уменьшения скорости

source: Key to decrease playback rate by a specified amount
ru: С помощью этой кнопки, вы сможете уменьшить скорость воспроизведения на заданную величину.

source: Speed up key
ru: Кнопка увеличения скорости

source: Key to increase playback rate by a specified amount
ru: С помощью этой кнопки, вы сможете увеличить скорость воспроизведения на заданную величину.

source: Speed up/down amount
ru: Величина увеличения/уменьшения скорости

source: How much to increase/decrease the playback rate
ru: Насколько увеличить/уменьшить скорость воспроизведения

source: Reset speed key
ru: Кнопка сброса скорости

source: Resets the playback rate to normal speed
ru: С помощью этой кнопки, вы сможете сбросить скорость воспроизведения до нормальной скорости

source: Screenshot key
ru: Кнопка снимка экрана

source: Screenshots the current frame in the video
ru: С помощью этой кнопки, вы сможете сделать снимок экрана текущего кадра на видео.

source: Screenshot format
ru: Формат снимка экрана

source: File format to save the screenshot in
ru: Формат файла для сохранения снимка экрана

source: Popup UI
ru: Пользовательский интерфейс всплывающего окна

source: Enables a UI on top of the popup
ru: Включает пользовательский интерфейс в верхней части всплывающего окна.

source: UI Toggle key
ru: Кнопка переключения пользовательского интерфейса

source: Toggles the display of the UI
ru: С помощью этой кнопи, вы сможете переключать отображение пользовательского интерфейса.

source: Opacity
ru: Непрозрачность

source: Opacity of the UI on top of the popup
ru: Непрозрачность пользовательского интерфейса в верхней части всплывающего окна.

source: Use safe glyphs
ru: Использовать безопасные глифы

source: Uses glyphs that are more likely to be available on all fonts. Enable this option if the following characters render as boxes: 🡇 🡐 🡒. The 'Noto Sans Symbols2' font contains these characters.
ru: Используются глифы, которые скорее всего, будут доступны на всех шрифтах. Включите этот параметр, если следующие символы отображаются в виде квадратиков: 🡇 🡐 🡒. Шрифт 'Noto Sans Symbols2' содержит эти символы.

source: Media resolution
ru: Разрешение медиа

source: Displays the original media dimensions on top of the UI. CSS ID: `#sizeinfo`
ru: Отображает оригинальные размеры медиа в верхней части пользовательского интерфейса. Индетификатор CSS: `#sizeinfo`

source: Zoom percent
ru: Масштабирование в процентах

source: Displays the current zoom level on top of the UI. CSS ID: `#sizeinfo`
ru: Отображает текущий уровень масштабирования в верхней части пользовательского интерфейса. Индетификатор CSS: `#sizeinfo`

source: File size
ru: Размер файла

source: Displays the media's file size on top of the UI. For the moment, this will not work with partially loaded media if 'Avoid HEAD request for partially loaded media' is enabled. CSS ID: `#sizeinfo`
ru: Отображает размер файла медиа в верхней части пользовательского интерфейса. На данный момент это не будет работать с частично загруженными медиа, если включён параметр 'Избегать запроса HEAD для частично загруженных медиа'. Индетификатор CSS: `#sizeinfo`

source: Gallery counter
ru: Счётчик галереи

source: Enables a gallery counter on top of the UI. CSS ID: `#gallerycounter`
ru: Отображает счётчик галереи в верхней части пользовательского интерфейса. Индетификатор CSS: `#gallerycounter`

source: Gallery counter max
ru: Максимальный счётчик галереи

source: Maximum amount of images to check in the counter (this can be slightly CPU-intensive)
ru: Максимальное количество изображений для проверки в счётчике (это может быть слегка ресурсоёмким для процессора)

source: Gallery buttons
ru: Кнопки галереи

source: Enables buttons to go left/right in the gallery. CSS IDs: `#galleryprevbtn`, `#gallerynextbtn`
ru: Включает кнопки влево/вправо в галерее. Индетификаторы CSS: `#galleryprevbtn`, `#gallerynextbtn`

source: Close Button
ru: Кнопка закрытия

source: Enables a button to close the popup. CSS ID: `#closebtn`
ru: Включает кнопку для закрытия всплывающего окна. Индетификатор CSS: `#closebtn`

source: Options Button
ru: Кнопка параметров

source: Enables a button to go to this page. CSS ID: `#optionsbtn`
ru: Включает кнопку для перехода на эту страницу. Индетификатор CSS: `#optionsbtn`

source: Download Button
ru: Кнопка скачивания

source: Enables a button to download the image. CSS ID: `#downloadbtn`
ru: Включает кнопку скачивания изображения. Индетификатор CSS: `#downloadbtn`

source: Rotation Buttons
ru: Кнопки вращения

source: Enables buttons on the UI to rotate the image by 90 degrees. CSS IDs: `#rotleftbtn`, `#rotrightbtn`
ru: Включает кнопки на пользовательском интерфейсе для поворота изображения на 90 градусов. Индетификаторы CSS: `#rotleftbtn`, `#rotrightbtn`

source: Caption
ru: Подпись

source: Shows the image's caption (if available) at the top. CSS ID: `#caption`
ru: Показывает вверху подпись к изображению (если таковая имеется). Индетификаторы CSS: `#caption`

source: Wrap caption text
ru: Обернуть текст подписи

source: Wraps the caption if it's too long
ru: Обёртывает подпись, если она слишком длинная.

source: Link original page in caption
ru: Ссылка на оригинальную страницу в подписи

source: Links the original page (if it exists) in the caption
ru: Ссылка в заголовке на оригинальную страницу (если она существует).

source: Underline links
ru: Подчёркивание ссылок

source: Adds an underline to links (such as the original page)
ru: Добавляет подчеркивание к ссылкам (например, оригинальная страница).

source: Keep popup open until
ru: Оставлять всплывающее окно открытым до тех пор, пока

source: Closes the popup when the selected condition is met
ru: Закрывает всплывающее окно при выполнении выбранного условия.

source: Any trigger is released
ru: Любая кнопка срабатывания отпущена

source: All triggers are released
ru: Все кнопки срабатывания отпущены

source: ESC/Close is pressed
ru: Нажато ESC/Закрыть

source: Don't close until mouse leaves
ru: Не закрывать пока курсор мыши не будет убран

source: If true, this keeps the popup open even if all triggers are released if the mouse is still over the image
ru: Если true, тогда если мышь всё еще находится на изображении, то всплывающее окно остаётся открытым, даже если все срабатывания отпущены.

source: Threshold to leave image
ru: Порог для выхода из изображения

source: How many pixels outside of the image before the cursor is considered to have left the image
ru: Сколько пикселей за пределами изображения перед курсором считается покинувшими изображение.

source: Leaving thumbnail cancels loading
ru: Отменять загрузку, если миниатюра покинута

source: Cancels the current popup loading when the cursor has left the thumbnail image
ru: Отменяет загрузку текущего всплывающего окна, когда курсор покинул миниатюру изображения.

source: ESC cancels loading
ru: ESC отменяет загрузку

source: Cancels the current popup loading if ESC is pressed
ru: Отменяет загрузку текущего всплывающего окна при нажатии кноки ESC.

source: Releasing triggers cancels loading
ru: Отменять загрузку, если кнопки активации отпущены

source: Cancels the current popup loading if all/any triggers are released (as set by the "Keep popup open until" setting)
ru: Отменяет загрузку текущего всплывающего окна, если все/любые кнопки срабатывания отпущены (в соответствии с настройками 'Оставлять всплывающее окно открытым до тех пор, пока'

source: Automatically close after timeout
ru: Автозакрытие после истечения времени

source: Closes the popup automatically after a specified period of time has elapsed
ru: Автоматически закрывает всплывающее окно по истечении заданного периода времени.

source: Timeout to close popup
ru: Времени до закрытия всплывающего окна

source: Amount of time to elapse before automatically closing the popup
ru: Количество времени, которое должно пройти до автоматического закрытия всплывающего окна.

source: Hold key
ru: Кнопка удкрживания

source: Hold key that, when pressed, will keep the popup open
ru: Кнопка удерживания, которая при нажатии будет оставлять всплывающее окно открытым.

source: Center popup on hold
ru: Центрировать всплывающее окно при удерживании

source: Centers the popup to the middle of the page when the popup is held
ru: Центрирует всплывающее окно на середине страницы, когда оно удерживается.

source: Close popup on unhold
ru: Зыкрывать всплывающее окно после отпускания удержания всплывающего окна

source: Closes the popup when the hold key is pressed again, after having previously held the popup
ru: Закрывает всплывающее окно при повторном нажатии клавиши удерживания после предыдущего удержания всплывающего окна.

source: Enable pointer events on hold
ru: Включать события указателя при удерживании

source: Enables previously disabled pointer events when the popup is held
ru: Включает ранее отключенные события указателя при удерживании всплывающего окна.

source: Clicking outside the popup closes
ru: Закрывать при нажатии за пределами всплывающего окна

source: Closes the popup when the mouse clicks outside of it
ru: Закрывает всплывающее окно при нажатии мыши за его пределами.

source: Close when leaving
ru: Закрывать при покидании

source: Closes the popup when the mouse leaves the thumbnail element, the popup, or both
ru: Закрывает всплывающее окно, когда мышь покидает элемент миниатюры, всплывающее окно или и то, и другое.

source: Thumbnail
ru: Миниатюры

source: Both
ru: Обоих

source: Use invisible element when waiting
ru: Использовать невидимый элемент при ожидании

source: Creates an invisible element under the cursor when waiting for the popup instead of a style element (can improve performance on websites with many elements, but prevents the cursor from clicking anything while loading the popup)
ru: Создаёт невидимый элемент под курсором при ожидании всплывающего окна вместо элемента стиля (может улучшить производительность на сайтах с большим количеством элементов, но не позволяет курсору нажимать на что-либо во время загрузки всплывающего окна).

source: Add popup link to history
ru: Добавлять всплывающую ссылку в историю

source: Adds the image/video link opened through the popup to the browser's history
ru: Добавляет ссылку на изображение/видео в историю браузера, открытые через всплывающее окно.

source: Allow inter-frame communication
ru: Разрешить межфреймовую связь

source: Allows communication between frames in windows, improving support for keybindings
ru: Позволяет осуществлять связь между фреимами в Windows, улучшая поддержку привязки клавиш.

source: Allows communication between frames in windows, improving support for keybindings. Can pose a fingerprinting risk when used through the userscript
ru: Позволяет осуществлять связь между фреимами в Windows, улучшая поддержку привязки клавиш. Может представлять риск снятия отпечатков пальцев при использовании через пользовательский скрипт.

source: Pop out of frames
ru: Выходить за рамки

source: Opens the popup on the top frame instead of within iframes. This option is still experimental.
ru: Открывает всплывающее окно поверх фрейма, а не внутри iframes. Этот параметр всё ещё является экспериментальным.

source: Popup default zoom
ru: Масштаб всплывающего окна по умолчанию

source: How the popup should be initially sized
ru: Каким будет изначальный размер всплывающего окна.

source: Fit to screen
ru: По размеру экрана

source: Fill screen
ru: Заполнить экран

source: Full size
ru: Полный размер

source: Custom size
ru: Пользовательский размер

source: Custom zoom percent
ru: Пользовательский процент масштабирования

source: Custom percent to initially size the popup
ru: Пользовательский процент для первоначального размера всплывающего окна6

source: Maximum width
ru: Максимальная ширина

source: Maximum width for the initial popup size. Set to `0` for unlimited.
ru: Максимальная ширина для начального размера всплывающего окна. `0` - неограниченная ширина.

source: Maximum height
ru: Максимальная высота

source: Maximum height for the initial popup size. Set to `0` for unlimited.
ru: Максимальная высота для начального размера всплывающего окна. `0` - неограниченная высота.

source: Popup panning method
ru: Способ панорамирования всплывающего окна

source: How the popup should be panned when larger than the screen
ru: Как всплывающее окно должно быть панорамировано, когда оно больше экрана.

source: Movement
ru: Перемещение

source: The popup pans as you move your mouse
ru: Всплывающее окно панорамируется когда вы перемещаете мышь.

source: Drag
ru: Перетаскивание

source: Clicking and dragging pans the popup
ru: Вы можете нажать и перетаскивать панель всплывающего окна.

source: Invert movement
ru: Инвертировать перемещение

source: Inverts the movement of the mouse. For example, if the mouse moves left, the popup moves right. If disabled, it feels more like the popup is being invisibly dragged.
ru: Инвертирует перемещение мышью. Например, если мышь движется влево, всплывающее окно перемещается вправо. Если отключено, то больше похоже на то, что всплывающее окно невидимо перетаскивается.

source: Minimum drag amount
ru: Минимальное количество для перетаскивания

source: How many pixels the mouse should move to start a drag
ru: На сколько пикселей мышь должна переместиться, чтобы начать перетаскивание.

source: pixels
ru: пикселей

source: Vertical scroll action
ru: Действие вертикальной прокрутки

source: How the popup reacts to a vertical scroll/mouse wheel event
ru: Как всплывающее окно реагирует на событие вертикальной прокрутки/колеса мыши.

source: Zoom
ru: Масштаб

source: Horizontal scroll action
ru: Действие горизонтальной прокрутки

source: How the popup reacts to a horizontal scroll/mouse wheel event
ru: Как всплывающее окно реагирует на событие горизонтальной прокрутки/колеса мыши.

source: Pan
ru: Панель

source: Gallery
ru: Галерея

source: Vertical video scroll action
ru: Действие вертикальной прокрутки видео

source: Overrides the vertical scroll action for videos. Set to `Default` to avoid overriding the behavior.
ru: Переопределяет действие вертикальной прокрутки для видео. Установите значение `По умолчанию`, чтобы избежать переопределения поведения.

source: Invert vertical scroll seek
ru: Инвертировать стремление вертикальной прокрутки

source: Inverts the seek direction when scrolling vertically: Scrolling up will seek right, scrolling down will seek left.
ru: Инвертирует направление стремления при вертикальной прокрутке: Прокрутка вверх будет стремиться вправо, прокрутка вниз будет стремиться влево.

source: Horizontal video scroll action
ru: Действие горизонтальной прокрутки видео

source: Overrides the horizontal scroll action for videos. Set to `Default` to avoid overriding the behavior.
ru: Переопределяет действие горизонтальной прокрутки для видео. Установите значение `По умолчанию`, чтобы избежать переопределения поведения.

source: Default
ru: По умолчанию

source: Seek
ru: Стремление

source: None
ru: Ничего

source: Override scroll outside of popup
ru: Переопределение прокрутки вне всплывающего окна

source: Scrolling outside of the popup will also be overriden by the script
ru: Прокрутка за пределами всплывающего окна также будет переопределена скриптом.

source: Zoom origin
ru: Начало масштабирования

source: The point on the image it's zoomed in/out from
ru: Точка на изображении, от которой оно увеличивается/уменьшается.

source: Cursor
ru: Курсор

source: Center
ru: Центр

source: Zoom behavior
ru: Поведение масштабирования

source: How zooming should work
ru: Как будет работать масштабирование.

source: Fit/Full
ru: По размеру/Полное

source: Toggles between the full size, and fit-to-screen
ru: Переключение между полным размером и по размеру экрану.

source: Incremental
ru: Пошаговое

source: Incremental zoom multiplier
ru: Множитель пошагового масштабирования

source: How much to zoom in/out by (for incremental zooming)
ru: На сколько увеличить/уменьшить масштаб (для пошагового масштабирования).

source: Move with cursor
ru: Перемещение с помощью курсора

source: Moves the popup as the cursor moves
ru: Перемещает всплывающее окно по мере перемещения курсора.

source: Move within page
ru: Перемещение внутри страницы

source: Ensures the popup doesn't leave the page
ru: Гарантирует, что всплывающее окно не покинет страницу.

source: Zoom out fully to close
ru: Закрывать при полном уменьшении масштаба

source: Closes the popup if you zoom out past the minimum zoom
ru: Закрывает всплывающее окно, если вы уменьшаете масштаб, превышающий минимальный.

source: Scroll past gallery end to close
ru: Закрывать при прокручивании до конца галереи

source: Closes the popup if you scroll past the end of the gallery
ru: Закрывает всплывающее окно, если вы прокручиваете его до конца галереи.

source: Popup position
ru: Положение всплывающего окна

source: Where the popup will appear
ru: Где появится всплывающее окно.

source: Cursor middle
ru: Середина курсора

source: Underneath the mouse cursor
ru: Под курсором

source: Beside cursor
ru: Рядом с курсором

source: Page middle
ru: Середина страницы

source: Prevent cursor overlap
ru: Предотвратить перекрытие курсора

source: Prevents the image from overlapping with the cursor
ru: Предотвращает перекрытие изображение с курсором.

source: Hide cursor over popup
ru: Скрывать курсор на всплывающем окне

source: Hides the cursor when the mouse is over the popup
ru: Скрывает курсор, когда мышь находится на всплывающем окне.

source: Hide cursor after
ru: Скрывать курсор после

source: Hides the cursor over the popup after a specified period of time (in milliseconds), 0 always hides the cursor
ru: Скрывает курсор во всплывающем окне после определенного периода времени (в миллисекундах). `0` - всегда скрывать курсор.

source: Mouse jitter threshold
ru: Порог дрожания мыши

source: Threshold for mouse movement before the mouse cursor is shown again, 0 always shows the cursor after any movement
ru: Порог для перемещения мыши до того, как курсор мыши будет показан снова. `0` - всегда показывать курсор после любого движения.

source: px
ru: пикс.

source: Disable pointer events
ru: Отключить события указателя

source: Enabling this option will allow you to click on links underneath the popup
ru: Включение этого параметра позволит вам нажимать на ссылки под всплывающим окном.

source: Ignore clicks outside popup
ru: Игнорировать клики вне всплывающего окна

source: Any mouse event outside the popup will be discarded with this option
ru: Любое событие мыши вне всплывающего окна будет отменено этим параметром.

source: Enable downloading HLS/DASH streams
ru: Включить скачивание потоков HLS/DASH

source: Downloads and muxes the contents of the streams rather than the stream information file. This currently does not work under Firefox.
ru: Загружает и мультиплексирует содержимое потоков, а не информационный файл потока. В настоящее время это не работает в Firefox.

source: Prefer MP4 over MKV
ru: Предпочитать MP4, а не MKV

source: Tries to mux the video into mp4 instead of mkv when required. This may slightly slow down muxing as it currently needs to try muxing both.
ru: Пытается мультиплексировать видео в mp4 вместо mkv, когда это требуется. Это может слегка замедлить процесс мультиплексирования, так как в настоящее время необходимо попробовать мультиплексировать и то, и другое.

source: Link image
ru: Ссылка на изображения

source: Adds a link to the image in the popup
ru: Добавляет ссылку на изображение во всплывающем окне.

source: Link video
ru: Ссылка на видео

source: Adds a link to the video in the popup
ru: Добавляет ссылку на видео во всплывающем окне.

source: Clicking image closes
ru: Закрывать изображение по нажатию на него

source: Clicking the popup image closes the popup
ru: Нажатие на всплывающее изображение закрывает всплывающее окно.

source: Clicking video closes
ru: Закрывать видео по нажатию на него

source: Clicking the popup video closes the popup
ru: Нажатие на всплывающее видео закрывает всплывающее окно.

source: Clicking link downloads
ru: Нажатие на ссылку скачивания

source: Instead of opening the link in a new tab, it will download the image/video instead
ru: Вместо того чтобы открывать ссылку в новой вкладке, она будет скачивать изображение/видео.

source: Close key
ru: Клавиша закрытия

source: Closes the popup when this key is pressed. Currently, ESC will also close the popup regardless of the value of this setting.
ru: При нажатии этой клавиши, закрывает всплывающее окно. В настоящее время ESC также закроет всплывающее окно независимо от значения этих настроек.

source: Download key
ru: Клавиша скачивания

source: Downloads the image in the popup when this key is pressed
ru: При нажатии этой клавиши, начнёт скачивать изображение во всплывающем окне.

source: Open in new tab key
ru: Клавиша открытия в новой вкладке

source: Opens the image in the popup in a new tab when this key is pressed
ru: При нажатии этой клавиши, открывает изображение во всплывающем окне на новой вкладке.

source: Open in background tab key
ru: Клавиша открытия в фоновой вкладке

source: Opens the image in the popup in a new tab without switching to it when this key is pressed
ru: При нажатии этой клавиши, открывает изображение во всплывающем окне на новой вкладке, не переходя на неё.

source: Copy link key
ru: Клавиша копирования ссылки
