Repository: qsniyg/maxurl
Catalog: po/*.po
Languages: ru

source: Copies the link of the media to the clipboard when this key is pressed
ru: При нажатии этой клавиши, копирует ссылку медиа в буфер обмена.

source: Open options key
ru: Клавиша открытия параметров

source: Opens this page in a new tab when this key is pressed
ru: При нажатии этой клавиши, откроет эту страницу в новой вкладке.

source: Open original page key
ru: Клавиша открытия страницы оригинала

source: Opens the original page (if available) when this key is pressed
ru: При нажатии этой клавиши, открывает страницу оригинала (если она доступна).

source: Rotate left key
ru: Клавиша поворота влево

source: Rotates the popup 90 degrees to the left
ru: При нажатии этой клавиши, поворачивает всплывающее окно на 90 градусов влево.

source: Rotate right key
ru: Клавиша поворота вправо

source: Rotates the popup 90 degrees to the right
ru: При нажатии этой клавиши, поворачивает всплывающее окно на 90 градусов вправо.

source: Horizontal flip key
ru: Клавиша для отражения по горизонтали

source: Flips the image horizontally
ru: При нажатии этой клавиши, зеркально отражает изображение по горизонтали.

source: Vertical flip key
ru: Клавиша для отражения по вертикали

source: Flips the image vertically
ru: При нажатии этой клавиши, зеркально отражает изображение по вертикали.

source: Zoom in key
ru: Клавиша увеличения масштаба

source: Incrementally zooms into the image
ru: При нажатии этой клавиши, увеличивает масштаб изображения.

source: Zoom out key
ru: Клавиша уменьшения масштаба

source: Incrementally zooms out of the image
ru: При нажатии этой клавиши, уменьшает масштаб изображения.

source: Full zoom key
ru: Клавиша полного масштабирования

source: Sets the image to be at a 100% zoom, even if it overflows the screen
ru: При нажатии этой клавиши, устанавливает 100%-ное масштабирование изображения, даже если оно переполняет экран.

source: Fit screen key
ru: Клавиша подгонки по размеру экрана

source: Sets the image to either be at a 100% zoom, or to fit the screen, whichever is smaller
ru: При нажатии этой клавиши, устанавливает изображение либо со 100%-ным масштабом, либо в соответствии с размером экрана, в зависимости от того, что меньше.

source: Toggle fullscreen key
ru: Клавиша переключения на весь экран

source: Toggles fullscreen mode for the image/video in the popup
ru: При нажатии этой клавиши, переключает полноэкранный режим для изображения/видео во всплывающем окне.

source: Popup for plain hyperlinks
ru: Всплывающее окно для простых гиперссылок

source: Whether or not the popup should also open for plain hyperlinks
ru: Должно ли всплывающее окно также открываться для простых гиперссылок.

source: Only for links that look valid
ru: Только для ссылок, которые выглядят допустимо

source: Enabling this option will only allow links to be popped up if they look valid (such as if they have a known image/video extension, or are explicitly supported)
ru: Включение этого параметра позволит всплывать ссылкам только в том случае, если они выглядят допустимыми (например, если они имеют известное расширение изображения/видео, или если они явно поддерживаются).

source: Popup page URL
ru: Всплывающее окно для URL страниц

source: If no element can be found, try the page URL. Only relevant for pagelink rules, such as image and video hosting websites
ru: Если ни один элемент не найден, попробуйте использовать URL-адрес страницы. Fктуально nолько для правил ссылки страницы, таких как сайты хостинга изображений и видео.

source: Popup for `<iframe>`
ru: Всплывающее окно для `<iframe>`

source: Allows `<iframe>` elements to be popped up as well. Storing images/videos in this way is rather uncommon, but it can allow embeds to be supported
ru: Позволяет всплывать элементам `<iframe>`. Хранение изображений/видео таким образом довольно редкое явление, но оно может позволить поддерживать встраиваемые файлы.

source: Popup for `<canvas>`
ru: Всплывающее окно для `<canvas>`

source: Allows `<canvas>` elements to be popped up as well. This will likely cause popups with any kind of web-based games, so it's recommended to keep this disabled
ru: Позволяет всплывать элементам `<canvas>`. Это, скорее всего, будет вызывать всплывающие окна с любыми веб-играми, поэтому рекомендуется отключить эту функцию.

source: Popup for `<svg>`
ru: Всплывающее окно для `<svg>`

source: Allows `<svg>` elements to be popped up as well. These are usually used for icons, and can occasionally cause problems for websites that overlay icons on top of images
ru: Позволяет всплывать элементам `<svg>`. Обычно они используются для иконок и иногда могут вызывать проблемы для веб-сайтов, которые накладывают иконки поверх изображений.

source: Enable gallery
ru: Включить галерею

source: Toggles whether gallery detection support should be enabled
ru: Переключает, должна ли быть включена поддержка обнаружения галереи.

source: Cycle gallery
ru: Зациклить галерею

source: Going to the previous image for the first image will lead to the last image and vice-versa
ru: Переход к предыдущему изображению с первого изображения приведет к последнему изображению и наоборот.

source: Previous gallery item
ru: Предыдущий элемент галереи

source: Key to trigger the previous gallery item
ru: Клавиша для запуска предыдущего элемента галереи.

source: Next gallery item
ru: Следующий элемент галереи

source: Key to trigger the next gallery item
ru: Клавиша для запуска следующего элемента галереи.

source: Gallery download key
ru: Клавиша скачивания галереи

source: Key to download the current gallery
ru: Клавиша для скачивания текущей галереи.

source: Download unchanged media
ru: Скачивать медиа без изменений

source: Includes gallery items that have not been changed. Useful to potentially avoid downloading thumbnails
ru: Включает в себя элементы галереи, которые не были изменены. Полезно, чтобы потенциально избежать скачивания миниатюр.

source: Zip: Store in subdirectory
ru: Zip: Хранить в подкаталоге

source: Stores the files in a subdirectory with the same name as the .zip file (without the .zip extension)
ru: Хранит файлы в подкаталоге с тем же именем, что и zip-файл (без расширения .zip).

source: Zip: Store info file
ru: Zip: Хранить информацию файла

source: Stores a `info.txt` file in the .zip containing information about the downloaded files and host page.
ru: Хранит файл `info.txt` в .zip, содержащую информацию о скачаных файлах и странице хоста.

source: Move to next when video finishes
ru: После заканчивания видео, переходить к следующему

source: Moves to the next gallery item when a video finishes playing
ru: Переход к следующему элементу галереи после завершения воспроизведения видео.

source: Popup CSS style
ru: Стиль CSS всплывающего окна

source: Custom CSS styles for the popup
ru: Пользовательские стили CSS для всплывающего окна.

source: Most valid CSS is supported, with these differences: <ul><li>Multiline comments (<code>/* ... */</code>) are currently not supported</li> <li>Single comments (<code>// ...</code>) are supported, but only at the beginning of a line</li> <li><code>%thumburl%</code> is the URL of the thumbnail image. For example, you could use it like this: <code>background-image: url(%thumburl%)</code><br /> The URL is properly encoded, so quotes are not necessary (but not harmful either)</li> <li><code>%fullurl%</code> is the URL of the full image. If IMU fails to find a larger image, it will be the same as <code>%thumburl%</code></li> <li>Styles are <code>!important</code> by default</li></ul> <p>For Button CSS style, you can also customize the CSS for individual buttons through their IDs. For example:</p> <pre> #closebtn { background-color: red; // -imu-text allows you to set the text inside the button -imu-text: "Close"; // -imu-title allows you to set the tooltip when hovering -imu-title: "Close the popup"; } #galleryprevbtn, #gallerynextbtn { border-radius: 100px; } </pre>
ru: Поддерживается большинство допустимого CSS, с этими отличиями: <ul><li>Многострочные комментарии (<code>/* ... */</code>) в настоящее время не поддерживаются</li> <li>Одиночные комментарии (<code>// ...</code>) поддерживаются, но только в начале строки</li> <li><code>%thumburl%</code> - это URL-адрес миниатюры изображения. Например, вы можете использовать его следующим образом: <code>background-image: url(%thumburl%)</code><br /> URL правильно закодирован, поэтому кавычки не нужны (но и не навредят)</li> <li><code>%fullurl%</code> - это URL-адрес полного изображения. Если IMU не может найти увеличенное изображение, оно будет таким же, как <code>%thumburl%</code></li> <li>Стили по умолчанию как <code>!important</code></li></ul> <p>Для стиля CSS кнопок, вы также можете настроить CSS для отдельных кнопок с помощью их идентификаторов. Например:</p> <pre> #closebtn { background-color: red; // -imu-text позволяет установить текст внутри кнопки -imu-text: "Закрыть"; // -imu-title позволяет установить всплывающую подсказку при наведении курсора -imu-title: "Закрыть всплывающее окно"; } #galleryprevbtn, #gallerynextbtn { border-radius: 100px; } </pre>

source: Enable popup fade
ru: Включить эффект затухания для всплывающего окна

source: Enables a fade in/out effect when the popup is opened/closed
ru: Включает эффект затухания/появления при открытии/закрытии всплывающего окна.

source: Enable zoom effect
ru: Включить эффект масштабирования

source: Toggles whether the popup should 'zoom' when opened/closed
ru: Переключает, должно ли всплывающее окно 'масштабироваться' при открытии/закрытии.

source: Move from thumbnail when zooming
ru: Перемещение от миниатюры при масштабировании

source: Moves the popup from the thumbnail to the final location while zooming. The animation can be a little rough
ru: Перемещает всплывающее окно от миниатюр до окончательного местоположения во время масштабирования. Анимация может быть немного грубой.

source: Popup animation time
ru: Время анимации всплывающего окна

source: Fade/zoom animation duration (in milliseconds) for the popup
ru: Уменьшение/увеличение продолжительности анимации (в миллисекундах) для всплывающего окна.

source: Enable background CSS
ru: Включить фон CSS

source: Toggles whether CSS styles for the background when the popup is active is enabled
ru: Переключает, включены ли стили CSS для фона, когда всплывающее окно активно.

source: On hold
ru: При удерживании

source: No
ru: Нет

source: Background CSS style
ru: Стиль CSS для фона

source: CSS style for the background when the popup is active. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't supported here)
ru: Стиль CSS для фона, когда всплывающее окно активно. Дополнительные сведения смотрите в документации 'Стилизация CSS всплывающего окна' (здесь не поддерживаются переменные URL thumb/full).

source: Background fade
ru: Затухание фона

source: Fade in/out time (in milliseconds) for the page background, set to 0 to disable
ru: Время затухания/появления (в миллисекундах) для фона страницы. 0 - отключить

source: ms
ru: мс

source: Button CSS style
ru: Стиль CSS для кнопок

source: Custom CSS styles for the popup's UI buttons. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't supported here)
ru: Пользовательские стили CSS для кнопок пользовательского интерфейса всплывающего окна. Дополнительные сведения смотрите в документации 'Стилизация CSS всплывающего окна' (здесь не поддерживаются переменные URL thumb/full).

source: Don't popup blacklisted URLs
ru: Не открывать чёрные списки URL-адресов во всплывающем окне

source: This option popping up for source media with blacklisted URLs. If this is disabled, the popup will open if the end URL isn't blacklisted, regardless of whether the source is blacklisted.
ru: Этот параметр всплывает для оригинальных медиа с URL-адресами в чёрный список. Если этот параметр отключен, всплывающее окно откроется, если конечный URL-адрес не внесён в чёрный список, независимо от того, внесен ли источник в чёрный список.

source: Apply blacklist for host websites
ru: Применять чёрный список для хост-сайтов

source: This option prevents the script from opening any popups to host websites that are in the blacklist. For example, adding `twitter.com` to the blacklist would prevent any popup from opening on twitter.com. If disabled, this option only applies to image URLs (such as twimg.com), not host URLs
ru: Этот параметр не позволяет скрипту открывать любые всплывающие окна сайтам, которые находятся в чёрном списке. Например, добавление `twitter.com` в чёрный список предотвратит открытие всплывающих окон на twitter.com. Если этот параметр отключен, он применяется только к URL-адресам изображений (например, twimg.com), а не URL-адресам хостов.

source: Don't popup different media type
ru: Нет всплывающих окон для других типов медиа

source: This option prevents the popup from loading a video when the source was an image or vice-versa
ru: Этот параметр запрещает всплывающему окну загружать видео, если источником было изображение, или наоборот.

source: Element finding mode
ru: Режим поиска элементов

source: How IMU should find the media element on the page.
ru: Как IMU будет искать медиа-элементы на странице.

source: This will result in a much higher CPU load for websites such as Facebook, and will occasionally return the wrong element. Use this option with caution.
ru: Это приведет к гораздо более высокой загрузке процессора для таких сайтов, как Facebook, и иногда будет возвращать неправильный элемент. Используйте этот параметр с осторожностью.

source: Full
ru: Полный

source: Manually looks through every element on the page to see if the cursor is above them. This will result in a higher CPU load for websites such as Facebook, and may return the wrong element
ru: Вручную просматривает каждый элемент на странице, чтобы увидеть, находится ли курсор над ними. Это приведет к более высокой загрузке процессора для таких сайтов, как Facebook, и может вернуть неправильный элемент.

source: Hybrid
ru: Гибридный

source: Looks manually through every child element of the last element found by `getElementsAtPoint`. Use this option if in doubt, it'll work on most sites
ru: Просматривает вручную каждый дочерний элемент последнего элемента, найденного с помощью `getElementsAtPoint`. Используйте этот вариант, если у вас есть сомнения. Он будет работать на большинстве сайтов.

source: Simple
ru: Простой

source: This is the fastest option, which uses the value of `getElementsAtPoint` without modification. Works for sites that don't use pointer-events:none and shadow DOM
ru: Это самый быстрый вариант, который использует значение `getElementsAtPoint` без изменений. Работает для сайтов, которые не используют pointer-events:none и shadow DOM.

source: Use cache
ru: Использовать кэш

source: Cache duration
ru: Длительность кэширования

source: How long for media to remain cached. Set to `0` for unlimited.
ru: Как долго медиа будут оставаться в кэше. `0` - всегда.

source: minutes
ru: мин.

source: Cache item limit
ru: Лимит элементов кэша

source: Maximum number of individual media to remain cached. Set to `0` for unlimited.
ru: Максимальное количество отдельных медиа для сохранения в кэше. `0` - без ограничения.

source: items
ru: эл.

source: Resume videos
ru: Возобновлять видео

source: If a video popup was closed then reopened, the video will resume from where it left off
ru: Если всплывающее окно видео было закрыто, а затем снова открыто, видео возобновится с того места, где оно было остановлено.

source: Use userscript
ru: Использовать пользовательский скрипт

source: Replaces the website's IMU instance with the userscript
ru: Заменяет сайт экземпляра IMU на пользовательский скрипт.

source: Website image preview
ru: Предпросмотр изображения сайта

source: Enables a preview of the image on the Image Max URL website
ru: Включает предварительный просмотр изображения на сайте Image Max URL

source: IMU entry in context menu
ru: Добавить IMU в контекстное меню

source: Enables a custom entry for this extension in the right click/context menu
ru: Включает пользовательскую запись для этого расширения в контекстном меню (нажатие правой кнопкой мыши).

source: Hot (re)load
ru: Горячая (пере)загрузка

source: (Re)loads the extension on all existing pages when installing or updating
ru: (Пере)загружает расширение на всех существующих страницах при установке или обновлении.

source: Custom XHR for libraries
ru: Пользовательский XHR для библиотек

source: Allows the use of more powerful XHR (network requests) for 3rd-party libraries. This allows for certain DASH streams to work.
ru: Позволяет использовать более мощные XHR (сетевые запросы) для сторонних библиотек. Это позволяет работать определенным потокам DASH.

source: Allows the use of more powerful XHR (network requests) for 3rd-party libraries. This allows for certain DASH streams to work. Using this with the userscript version currently poses a potential security risk.
ru: Позволяет использовать более мощные XHR (сетевые запросы) для сторонних библиотек. Это позволяет работать определенным потокам DASH. Использование его в версии пользовательского скрипта в настоящее время представляет собой потенциальный риск для безопасности.

source: Instagram (downloading)
ru: Instagram (скачивание)

source: HLS/DASH maximum quality
ru: Максимальное качество HLS/DASH

source: Uses the maximum quality for HLS/DASH streams
ru: Использует максимальное качество для потоков HLS/DASH.

source: Maximum video quality
ru: Максимальное качество видео

source: Maximum quality for videos
ru: Максимальное качество для видео.

source: (unlimited)
ru: (неограниченное)

source: Larger watermarked images
ru: Большие изображения с водяными знаками

source: Enables rules that return larger images that include watermarks
ru: Включает правила, возвращающие более крупные изображения с водяными знаками.

source: Stock photo websites
ru: Сайты со стоковыми фото

source: Smaller non-watermarked images
ru: Небольшие изображения без водяных знаков

source: Enables rules that return smaller images without watermarks
ru: Включает правила, возвращающие меньшие изображения без водяных знаков.

source: Possibly different images
ru: Возможно, разные изображения

source: Enables rules that return images that possibly differ, usually due to server-side caching
ru: Включает правила, возвращающие изображения, которые могут отличаться, как правило, из-за кэширования на стороне сервера.

source: Possibly broken images
ru: Возможно, сломанные изображения

source: Enables rules that return images that are possibly broken
ru: Включает правила, возвращающие изображения, которые могут быть поломаны.

source: Possibly upscaled images
ru: Возможно, увеличенные изображения

source: Enables rules that return images that are possibly upscaled
ru: Включает правила, возвращающие изображения, которые могут быть увеличены.

source: Rules using 3rd-party websites
ru: Правила использования сторонних сайтов

source: Enables rules that use 3rd-party websites
ru: Включает правила, которые используют сторонние сайты.

source: Rules using API calls
ru: Правила, использующие вызовы API

source: Enables rules that use API calls. Strongly recommended to keep this enabled
ru: Включает правила, использующие вызовы API. Настоятельно рекомендуется оставлять эту функцию включённой.

source: Allow 3rd-party libraries
ru: Разрешить сторонние библиотеки

source: Enables using 3rd-party libraries. This is both used in rules and as a prerequisite for certain functionality.
ru: Позволяет использовать сторонние библиотеки. Это используется как в правилах, так и в качестве предварительного условия для определённой функциональности.

source: Enables using 3rd-party libraries. This is both used in rules and as a prerequisite for certain functionality. There is a possible (but unlikely) security risk for the userscript version.
ru: Позволяет использовать сторонние библиотеки. Это используется как в правилах, так и в качестве предварительного условия для определённой функциональности. Существует возможный (но маловероятный) риск безопасности для версии пользовательского скрипта.

source: Sites using testcookie (slowAES)
ru: Сайты, использующие testcookie (slowAES)

source: Rules executing 3rd-party code
ru: Правила выполнения стороннего кода

source: Enables rules that execute arbitrary 3rd-party code stored on websites.
ru: Включает правила, которые выполняют произвольный сторонний код, хранящийся на сайтах.

source: This could lead to security risks, please be careful when using this option!
ru: Это может привести к угрозам безопасности, будьте осторожны при использовании этого параметра!

source: Rules using brute-force
ru: Правила, использующие грубую силу

source: Enables rules that require using brute force (through binary search) to find the original image
ru: Включает правила, требующие использования грубой силы (через бинарный поиск) для поиска оригинального изображения.

source: DeviantART: Prefer size over original
ru: DeviantART: Предпочитать размер оригиналу

source: Prefers a larger (but not upscaled) thumbnail image over a smaller original animated image
ru: Предпочитает больше (но не увеличенное) миниатюрное изображение меньшему оригинальному анимированному изображению.

source: DeviantART: Use download links
ru: DeviantART: Использовать ссылки для скачивания

source: Prefers using the download link (if available) by default. Note that this only works if you're logged in to DeviantART
ru: Предпочитает использовать ссылку для скачивания (если она доступна) по умолчанию. Обратите внимание, что это работает, только если вы вошли в свою учётную запись DeviantART.

source: E-Hentai: Use full image
ru: E-Hentai: Использовать полное изображение

source: Prefers using full/original images if available (logged in). This is more likely to get you rate limited
ru: Предпочитает использовать полные/оригинальные изображения, если таковые имеются. (требуется вход). Скорее всего, это ограничит вашу скорость.

source: Imgur: Use original filename
ru: Imgur: Использовать оригинальное имя файла

source: If the original filename (the one used to upload the image) is found, use it instead of the image ID
ru: Если найдено оригинальное имя файла (используемое для скачивания изображения), используйте его вместо идентификатора изображения.

source: Imgur: Use source image
ru: Imgur: Использовать изображение источника

source: If a source image is found for Imgur, try using it instead. Only works for old-style Imgur webpages (set `postpagebeta=0; postpagebetalogged=0` as cookies)
ru: Если для Imgur найдено изображение источника, попробуйте использовать его вместо этого. Работает только для веб-страниц Imgur старого стиля (установите `postpagebeta=0; postpagebetalogged=0` как cookie).

source: Instagram: Use native API
ru: Instagram: Использовать родной API

source: Instagram: Don't use web API
ru: Instagram: Без использования веб-API

source: Avoids using Instagram's web API if possible, which increases performance, but will occasionally sacrifice quality for videos
ru: Избегает использования веб-API Instagram, если это возможно, что повышает производительность, но иногда жертвует качеством видео.

source: Instagram: Prefer quality over resolution
ru: Instagram: Предпочитать качество разрешению

source: Prefers lower resolution videos that use a higher bitrate over higher resolution images. This adds a slight performance cost as it needs to fetch headers for multiple videos
ru: Предпочитает видео с более низким разрешением, которые используют более высокий битрейт по сравнению с изображениями с более высоким разрешением. Это добавляет небольшие затраты на производительность, так как это нуждается в получении заголовков для нескольких видео.

source: Instagram: Use albums for post thumbnails
ru: Instagram: Использовать альбомы для миниатюр постов
